ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/ДокументыОПредстоящейПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыОПредстоящейПоставке</name>
  <resources>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеДОПП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВвоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПодакцизногоТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДОПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ut/src/Documents/ДокументОПредстоящейПоставке/ДокументОПредстоящейПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументОПредстоящейПоставке</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДОПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДОПП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбеспечительногоПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураРеквизитовВыгрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВвоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйЗнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйЗнакПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйЗнакПрицепаДополнительный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыйПризнакДОПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыйПризнакЗаявителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнойОсобыйПризнакЗаявителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактурнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодакцизныйТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПодакцизныхТоваров</name>
      <type>
        <types>CatalogRef.КатегорииПодакцизныхТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияАкциза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяБазаАкцизы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдвалорнаяСтавкаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТвердаяСтавкаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПересчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяБазаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркируемаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсобыйПризнакДОПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбеспечительныйПлатеж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Запись данных ДОПП.
// 
// Параметры:
//  СтруктураПараметров - Структура:
//	** Организация - СправочникСсылка.Организации
//	** СсылкаДОПП - ДокументСсылка.ДокументОПредстоящейПоставке
//	** НомерДОПП - Строка(13)
//	** Комментарий - Строка
//	** Контрагент - СправочникСсылка.Контрагенты
//	** СуммаОбеспечительногоПлатежа - Число
Процедура ЗаписьДанныхДОПП(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НомерДОПП",   СтруктураПараметров.НомерДОПП);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыОПредстоящейПоставке.НомерДОПП КАК НомерДОПП,
	|	ДокументыОПредстоящейПоставке.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
	|ГДЕ
	|	ДокументыОПредстоящейПоставке.Организация = &Организация
	|	И ДокументыОПредстоящейПоставке.НомерДОПП = &НомерДОПП
	|	И ДокументыОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостояниеДОПП.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДокументОПредстоящейПоставкеТовары.КБК КАК КБК,
	|	СУММА(ДокументОПредстоящейПоставкеТовары.СуммаАкциза) КАК СуммаНалога,
	|	МАКСИМУМ(ДокументОПредстоящейПоставкеТовары.КатегорияПодакцизныхТоваров) КАК КатегорияПодакцизногоТовара
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставкеТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка
	|	И ДокументОПредстоящейПоставкеТовары.ПодакцизныйТовар
	|	И НЕ ДокументОПредстоящейПоставкеТовары.МаркируемаяПродукция
	|	И ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя = ""0""
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставкеТовары.КБК,
	|	ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	&КБКНДС,
	|	ВЫБОР
	|		КОГДА ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя = ""0""
	|		ТОГДА СУММА(ДокументОПредстоящейПоставкеТовары.СуммаНДС)
	|	ИНАЧЕ 0 КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставкеТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	СуммаНалога";
	
	КБКНДС     = УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров();
	КБКНулевой = УчетНДСОтчетыПереопределяемый.НулевойКБКПриВвозеТоваров();
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.СсылкаДОПП);
	Запрос.УстановитьПараметр("КБКНДС", КБКНДС);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОКруглениеПоДокументу = СтруктураПараметров.СуммаОбеспечительногоПлатежа - РезультатЗапроса.Итог("СуммаНалога");
	ОкруглениеНДС = 0;
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДокументыОПредстоящейПоставке");
		ЭлементБлокировки.УстановитьЗначение("Организация", СтруктураПараметров.Организация);
		ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   СтруктураПараметров.НомерДОПП);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация);
		НаборЗаписей.Отбор.НомерДОПП.Установить(СтруктураПараметров.НомерДОПП);
		
		Для Каждого СтрокаНалога Из РезультатЗапроса Цикл
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтруктураПараметров);
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаНалога);
			Если СтрокаНалога.Порядок = 1 Тогда
				ОкруглениеНДС = Окр(ЗаписьРегистра.СуммаНалога) - ЗаписьРегистра.СуммаНалога;
				ЗаписьРегистра.СуммаНалога = Окр(ЗаписьРегистра.СуммаНалога);
			ИначеЕсли ОКруглениеПоДокументу - ОкруглениеНДС <> 0 Тогда
				ЗаписьРегистра.СуммаНалога = ЗаписьРегистра.СуммаНалога + ОКруглениеПоДокументу - ОкруглениеНДС;
				ОКруглениеПоДокументу = ОкруглениеНДС;
			КонецЕсли;
			Если СтруктураПараметров.СуммаОбеспечительногоПлатежа = 0 Тогда
				ЗаписьРегистра.КБК = КБКНулевой;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	Исключение
		
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Не удалось записать данные по ДОПП:
				|%1'"),
			КраткоеПредставлениеОшибки);
			
		Отказ = Истина;
		
		ВызватьИсключение ТекстОшибки;
	
	КонецПопытки;
	
КонецПроцедуры

// Получить Таблицу КБК
// 
// Параметры:
//  КодБКНДС - Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить коды БК:
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКодыБК(КодБКНДС = Неопределено) Экспорт
	
	КБКРаздел2 = Новый ТаблицаЗначений;
	КБКРаздел2.Колонки.Добавить("Код",      ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКРаздел2.Колонки.Добавить("Название", ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	
	Если ЗначениеЗаполнено(КодБКНДС) Тогда
		Строка = КБКРаздел2.Добавить();
		Строка.Код = КодБКНДС;
		Строка.Название = НСтр("ru='НДС при импорте товаров из ЕАЭС'");
	КонецЕсли;
	
	Возврат КБКРаздел2;
	
КонецФункции

// Получить КБК в разрезе категорий для подакцизных товаров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить КБКПо категориям товаров:
// * КодПодакцизногоТовара - Строка 
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКБКПоКатегориямТоваров() Экспорт
	
	КБКПоКатегориямТоваров = Новый ТаблицаЗначений;
	КБКПоКатегориямТоваров.Колонки.Добавить("КодПодакцизногоТовара", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	КБКПоКатегориямТоваров.Колонки.Добавить("Код",                   ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКПоКатегориямТоваров.Колонки.Добавить("Название",              ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	
	Возврат КБКПоКатегориямТоваров;
	
КонецФункции

// Получает КБК по Виду налога
// 
// Параметры:
//  Результат - Структура
// 
// Возвращаемое значение:
//  Строка - КБК
Функция УточнитьКБК(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	КБКПоВидуПлатежа = УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров();
	
	
	Возврат КБКПоВидуПлатежа;
	
КонецФункции


// Отмена данных по Номеру ДОПП.
// Если данные по Номеру ДОПП уже включены в декларацию (Состояние заполнено),
// запись оставляем. Такие записи пользователь должен отредактировать вручную.
// 
// Параметры:
//	Организация - СправочникСсылка.Организации
//	НомерДОПП - Строка
//	Отказ - Булево
Процедура ОтменаДанныхПоНомеруДОПП(Организация, НомерДОПП, Отказ) Экспорт
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДокументыОПредстоящейПоставке");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   НомерДОПП);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.НомерДОПП.Установить(НомерДОПП);
		НаборЗаписей.Прочитать();
		МассивСтрокКУдалению = Новый Массив();
		Для Каждого СтрокаДанных Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(СтрокаДанных.Состояние) Тогда
				МассивСтрокКУдалению.Добавить(СтрокаДанных);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из МассивСтрокКУдалению Цикл
			НаборЗаписей.Удалить(Строка);
		КонецЦикла;
		НаборЗаписей.Записать();
		
	Исключение
					
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Не удалось отменить данные по Номеру ДОПП по причине:
				|%1'"),
			КраткоеПредставлениеОшибки);
			
		Отказ = Истина;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
